import { Button, Htag, P } from '@/components';
import styles from './Speech.module.css';

export const Speech = (): JSX.Element => {
	return (
		<div className={styles['speech']}>
			<Htag tag="h3" appearanceTag="h2">
				🏆 KingMovies: Итоги 2025
			</Htag>
			<br />
			<P color="gray">
				Друзья, мы подводим грандиозные итоги! Этот рейтинг — результат вашей активности за последние два года. Мы внимательно следили за
				каждым просмотром и каждым достижением, чтобы выделить самых преданных киноманов.
			</P>
			<br />
			<br />
			<P color="gray">
				Это первый и последний «двухлетний» отчет. Начиная со следующего года, мы переходим на формат ежегодного рейтинга. Каждый январь
				мы будем фиксировать текущую сезонную статистику и выбирать лучших зрителей по итогам текущего года. Это даст шанс новичкам
				ворваться в топ и занять почетное место на пьедестале!
			</P>
			<br />
			<br />
			<Htag tag="h3" color="white">
				❤️ Спасибо, что вы с нами!
			</Htag>
			<P color="gray">
				Мы искренне благодарны каждому пользователю за то, что выбираете <span>KingMovies</span>. Наша команда горит идеей сделать лучший
				сервис для просмотра кино, и мы будем развивать его дальше, добавляя новые фишки и контент.
			</P>
			<br />
			<br />
			<Htag tag="h3" color="white">
				⭐ Ваше мнение меняет приложение
			</Htag>
			<P color="gray">Есть крутая идея или что-то работает не так? </P>
			<br />
			<br />
			<Button stretch>
				<a target="_blank" href="mailto:akimov1712@yandex.ru">
					Написать разработчику
				</a>
			</Button>
			<br />
			<P>
				Хотите поддержать проект? Оставьте честный отзыв в{' '}
				<span>
					<a target="_blank" href="https://www.rustore.ru/catalog/app/ru.kingmovies.km">
						RuStore
					</a>
				</span>{' '}
				— это очень помогает нам расти и становиться заметнее
			</P>
			<br />
			<a className={styles['rustore-button']} target="_blank" href="https://www.rustore.ru/catalog/app/ru.kingmovies.km">
				<svg xmlns="http://www.w3.org/2000/svg" width="159" height="30" viewBox="0 0 159 30" fill="none">
					<g clip-path="url(#clip0_3597_34339)">
						<path
							d="M20.8347 28.1746C22.9837 30.3299 26.4425 30.3299 33.36 30.3299H34.5828C41.5004 30.3299 44.9592 30.3299 47.1082 28.1746C49.2572 26.0194 49.2572 22.5506 49.2572 15.613V14.3866C49.2572 7.44907 49.2572 3.98021 47.1082 1.82503C44.9592 -0.330078 41.5004 -0.330078 34.5828 -0.330078H33.36C26.4425 -0.330078 22.9837 -0.330078 20.8347 1.82503C18.6857 3.98021 18.6857 7.44907 18.6857 14.3866V15.613C18.6857 22.5506 18.6857 26.0194 20.8347 28.1746Z"
							fill="white"
						/>
						<path
							fill-rule="evenodd"
							clip-rule="evenodd"
							d="M42.2886 20.0488L40.223 19.5313C39.9743 19.4598 39.7986 19.2353 39.7898 18.9744L39.532 11.3497C39.4574 10.3405 38.7105 9.53786 37.9299 9.30149C37.8861 9.28821 37.8393 9.30611 37.8133 9.34396C37.7869 9.38233 37.7971 9.43552 37.8339 9.46412C38.0267 9.61374 38.5572 10.1021 38.5572 10.9444L38.5557 20.9136C38.5557 21.8762 37.6487 22.5821 36.7131 22.3477L34.6156 21.8222C34.383 21.7406 34.2215 21.5234 34.213 21.2728L33.9552 13.6477C33.8807 12.6385 33.1337 11.8358 32.3531 11.5994C32.3093 11.5862 32.2625 11.6041 32.2365 11.6418C32.2102 11.6803 32.2203 11.7335 32.2572 11.762C32.4499 11.9117 32.9804 12.4 32.9804 13.2423L32.9789 21.5521L32.98 21.5523V23.2124C32.98 24.175 32.073 24.881 31.1375 24.6466L25.2128 23.1624C24.3892 22.956 23.8116 22.217 23.8116 21.3695V11.3849C23.8116 10.4223 24.7186 9.71625 25.6542 9.95066L29.3873 10.886V9.08601C29.3873 8.12339 30.2943 7.41744 31.2299 7.65176L34.9628 8.58697V6.78711C34.9628 5.82441 35.8698 5.11846 36.8053 5.35286L42.73 6.83713C43.5536 7.04344 44.1312 7.78236 44.1312 8.62988V18.6146C44.1312 19.5772 43.2242 20.2831 42.2886 20.0488Z"
							fill="#0077FF"
						/>
						<path
							d="M66.464 17.2838C68.7594 16.6918 70.2677 14.916 70.2677 12.5921C70.2677 9.72009 67.9942 7.70312 64.8026 7.70312H59.119V23.1593H61.7422V17.4811H63.6003L67.6664 23.1593H70.7486L66.464 17.2838ZM64.8026 10.1147C66.4422 10.1147 67.5789 11.1233 67.5789 12.5921C67.5789 14.061 66.4422 15.0695 64.8026 15.0695H61.7422V10.1147H64.8026Z"
							fill="white"
						/>
						<path
							d="M76.6525 23.3793C78.0297 23.3793 79.2976 22.6558 80.0189 21.45L80.5217 23.16H82.4017V11.7598H79.8878V18.3588C79.8878 19.9811 78.8166 21.1212 77.352 21.1212C75.9093 21.1212 74.9037 19.9811 74.9037 18.3588V11.7598H72.3898V18.6438C72.3898 21.3842 74.226 23.3793 76.6525 23.3793Z"
							fill="white"
						/>
						<path
							d="M90.4243 23.379C93.3317 23.379 95.7369 21.7127 95.7369 18.9504C95.7369 15.8592 93.2229 14.9603 91.0586 14.2149C89.3752 13.6449 87.9103 13.1188 87.9103 11.7375C87.9103 10.5318 89.0254 9.89598 90.3369 9.89598C91.7143 9.89598 92.6983 10.6195 93.2443 11.8472L95.7369 11.4307C94.95 9.01909 92.9606 7.48438 90.2494 7.48438C87.4517 7.48438 85.2219 9.10678 85.2219 11.8691C85.2219 14.9823 87.7354 15.8372 89.8997 16.5607C91.5617 17.1089 93.048 17.635 93.048 19.0381C93.048 20.2658 91.9329 20.9674 90.4466 20.9674C88.7417 20.9674 87.8229 20.1562 87.0146 18.6873L84.4786 19.1258C85.2219 21.7347 87.5829 23.379 90.4243 23.379Z"
							fill="white"
						/>
						<path
							d="M102.575 20.9671C101.723 20.9671 101.307 20.5506 101.307 19.6955V13.9516H104.696V11.7592H101.307V8.4707H99.4277L98.7935 11.7592H96.9352V13.9516H98.7935V19.6955C98.7935 21.9317 100.083 23.1595 102.575 23.1595H104.696L104.914 20.9671H102.575Z"
							fill="white"
						/>
						<path
							d="M112.098 23.3788C115.662 23.3788 118.175 20.9234 118.175 17.4595C118.175 13.9955 115.662 11.54 112.098 11.54C108.535 11.54 106.021 13.9955 106.021 17.4595C106.021 20.9234 108.535 23.3788 112.098 23.3788ZM112.098 21.0768C110.043 21.0768 108.645 19.608 108.645 17.4595C108.645 15.311 110.043 13.842 112.098 13.842C114.153 13.842 115.552 15.311 115.552 17.4595C115.552 19.608 114.153 21.0768 112.098 21.0768Z"
							fill="white"
						/>
						<path
							d="M122.875 23.16V16.4295C122.875 14.9826 123.574 14.1714 125.105 14.1714H126.548L126.329 11.7598H125.848C124.515 11.7598 123.487 12.1325 122.722 13.4041L122.241 11.7598H120.361V23.16H122.875Z"
							fill="white"
						/>
						<path
							d="M138.917 17.3279C138.917 14.0393 136.469 11.54 133.015 11.54C129.561 11.54 127.113 14.0174 127.113 17.4595C127.113 20.9014 129.561 23.3788 133.015 23.3788C135.376 23.3788 137.606 22.2607 138.459 20.0902L136.097 19.6956C135.551 20.5068 134.502 21.0768 133.168 21.0768C131.245 21.0768 129.976 19.8929 129.736 18.139H138.873C138.896 17.8979 138.917 17.6348 138.917 17.3279ZM133.015 13.7324C134.589 13.7324 135.77 14.7409 136.185 16.1659H129.889C130.305 14.6971 131.485 13.7324 133.015 13.7324Z"
							fill="white"
						/>
					</g>
					<defs>
						<clipPath id="clip0_3597_34339">
							<rect width="159" height="30" fill="white" />
						</clipPath>
					</defs>
				</svg>
			</a>
		</div>
	);
};
